Revit 2027 API
RebarContainerParameterManager.SetOverriddenParameterModifiable Method
 Sets this overridden parameter to be modifiable.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOverriddenParameterModifiable(
	ElementId paramId
)
Public Sub SetOverriddenParameterModifiable (
	paramId As ElementId
)
public:
void SetOverriddenParameterModifiable(
	ElementId^ paramId
)
member SetOverriddenParameterModifiable :
        paramId : ElementId -> unit
Parameters
paramId ElementId
 Overridden parameter id
Exceptions
Exception | Condition
ArgumentException |  paramId has no override
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace